      ******************************************************************
       01   DB-CONN.
           05  DB-USER                 PIC X(20) VALUE 'root'.
           05  DB-PASSWORD             PIC X(20) VALUE 'root'.
           05  DB-NAME                 PIC X(20) VALUE 'banco'.
           05  DB-HOST                 PIC X(20) VALUE 'localhost'.
           05  DB-PORT                 PIC 9(5)  VALUE 3306.
      ******************************************************************
