      ******************************************************************
      * Configuracion del sistema 23-Feb-2025
      ******************************************************************
       01  CONF-HIPOTECAS.
           05    PORC-MIN-GRNTIA  PIC 9(3)V99 VALUE 90.33.
